import re

s = """utt: rFV7wdEX-Mo_0266
WER: 0.00 % N=20 C=20 S=0 D=0 I=0
lab: 这 就 是 我 给 大 家 也 是 给 决 策 者 们 的 简 单 的 建 议 
rec: 这 就 是 我 给 大 家 也 是 给 决 策 者 们 的 简 单 的 建 议 


utt: rFV7wdEX-Mo_0267
WER: 0.00 % N=34 C=34 S=0 D=0 I=0
lab: 大 家 也 许 会 吃 惊 地 发 现 大 多 数 人 包 括 大 多 数 决 策 者 都 没 有 对 此 予 以 足 够 的 重 视 
rec: 大 家 也 许 会 吃 惊 地 发 现 大 多 数 人 包 括 大 多 数 决 策 者 都 没 有 对 此 予 以 足 够 的 重 视 


utt: rFV7wdEX-Mo_0268
WER: 0.00 % N=23 C=23 S=0 D=0 I=0
lab: 这 个 模 式 对 我 很 有 用 希 望 它 也 将 对 你 们 有 用 谢 谢 大 家 
rec: 这 个 模 式 对 我 很 有 用 希 望 它 也 将 对 你 们 有 用 谢 谢 大 家 

===========================================================================

Overall -> 3.23 % N=23721 C=23072 S=502 D=147 I=117
Mandarin -> 2.92 % N=23635 C=23063 S=452 D=120 I=117
English -> 90.59 % N=85 C=8 S=50 D=27 I=0
Other -> 0.00 % N=1 C=1 S=0 D=0 I=0

==========================================================================="""
matches = re.search(r'Mandarin -> (\d+\.?\d*) %.*S=(\d+) D=(\d+) I=(\d+)', s)

# 如果匹配成功，将匹配到的结果放入一个列表中
if matches:
    numbers = [float(matches.group(i)) for i in range(1, 5)]
    print(numbers)  # 输出: [2.92, 452.0, 120.0, 117.0]