{"class_name": "Functional", "config": {"name": "functional_91", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1498], "dtype": "float32", "sparse": false, "ragged": false, "name": "aa3mer_input"}, "name": "aa3mer_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "aa3mer_embedding", "trainable": false, "batch_input_shape": [null, 1498], "dtype": "float32", "input_dim": 9049, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1498}, "name": "aa3mer_embedding", "inbound_nodes": [[["aa3mer_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["aa3mer_embedding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_180", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_180", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_180", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_180", "inbound_nodes": [[["batch_normalization_180", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "maxpool1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "maxpool1", "inbound_nodes": [[["activation_180", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_225", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_225", "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2", "inbound_nodes": [[["dropout_225", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_181", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_181", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_181", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_181", "inbound_nodes": [[["batch_normalization_181", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "maxpool2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "maxpool2", "inbound_nodes": [[["activation_181", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_226", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_226", "inbound_nodes": [[["maxpool2", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_45", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d_45", "inbound_nodes": [[["dropout_226", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_227", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_227", "inbound_nodes": [[["global_max_pooling1d_45", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense1", "inbound_nodes": [[["dropout_227", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_182", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_182", "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_182", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_182", "inbound_nodes": [[["batch_normalization_182", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_228", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_228", "inbound_nodes": [[["activation_182", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense2", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense2", "inbound_nodes": [[["dropout_228", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_183", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_183", "inbound_nodes": [[["dense2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_183", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_183", "inbound_nodes": [[["batch_normalization_183", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_229", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_229", "inbound_nodes": [[["activation_183", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_45", "inbound_nodes": [[["dropout_229", 0, 0, {}]]]}], "input_layers": [["aa3mer_input", 0, 0]], "output_layers": [["dense_45", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}