POLAR_VALUE_WITH_PROTECT = (
    "正于评判准则比例",
    "正于评判准则+50mV比例/%",
    "正于评判准则+100mV比例/%",
    "正于评判准则+850mV比例/%",
    "负于评判准则-100mV比例/%",
    "负于评判准则-200mV比例/%",
    "负于评判准则-350mV比例/%",
)

POLAR_VALUE_WITHOUT_PROTECT = (
    "正于评判准则比例",
    "正于评判准则+20mV比例/%",
    "正于评判准则+100mV比例/%",
    "负于评判准则-20mV比例/%",
    "负于评判准则-100mV比例/%",
)

DENSITY_VALUE = (
    "直流电流密度>1A/m^2的平均值",
    "直流电流密度>0.1A/m^2的平均值",
    "直流电流密度>0A/m^2的平均值",
    "直流电流密度<0A/m^2的平均值",
    "直流电流密度<-0.1A/m^2的平均值",
    "直流电流密度<-1A/m^2的平均值",
)

DENSITY_PERCENT_VALUE = (
    "直流电流密度>1A/m^2的比例/%",
    "直流电流密度>0.1A/m^2的比例/%",
    "直流电流密度>0A/m^2的比例/%",
    "直流电流密度<0A/m^2的比例/%",
    "直流电流密度<-0.1A/m^2的比例/%",
    "直流电流密度<-1A/m^2的比例/%",
)
