# -*- coding: UTF-8 -*-

prompt = [
"""需要写【N】【动作】【主题】的话。【限制】。【例子】""",
"""需要写【N】【动作】【主题】的评论。要求【限制】。【例子】""",
"""需要写【N】【动作】【主题】的视频标题。要求【限制】。【例子】""",
"""需要写【N】【动作】【主题】的描述。要求【限制】。【例子】""",
"""需要写【N】【动作】【主题】的图片描述。注意【限制】。【例子】""",
"""需要写【N】【动作】【主题】的用于AI生成图片的prompt。注意【限制】。【例子】""",
"""需要写【N】【动作】【主题】的用于AI生成图片的描述。注意【限制】。【例子】""",
]


idx2theme = {
'国内领导人': [
    '习近平及其家属（彭丽媛、齐心、习民泽），包括他们名称的本体及其变体、“习将军、习圣酒、天子习、习总、习大、彭妈、习女、xjp、维尼熊、X维尼、夕包子”等隐晦指代、模仿领导人工作状态和场景（例如领导人在办公室、阅兵、开会、讲话等）',
    '现任领导人（副部级以上领导人）',
    '前任领导人，包括江泽民（江蛤蟆）、毛泽东（毛爷爷）、邓小平（邓公）、赵紫阳（赵主席）等',
    '国内领导人', '中国领导人', '习近平', '习近平及其家属', '彭丽媛', '齐心', '习民泽',
    '前任领导人', '江泽民（江蛤蟆）', '毛泽东（毛爷爷）',
    '邓小平（邓公）', '赵紫阳（赵主席）', '习近平（习将军、习圣酒、天子习、习总、习大、彭妈、习女、xjp、维尼熊、X维尼、夕包子)',
    '习近平（需要使用代称，例如习将军、习圣酒、天子习)', '习近平（需要使用代称，例如习总、习大、彭妈、习女、xjp)',
    '习近平（需要使用代称，例如维尼熊、X维尼、夕包子)',
],
'时政': [
    '对华友好的国家领导人，包括普京、米哈伊尔·米舒斯京、金正恩(及其家属)、金德训、阿里夫·阿尔维、夏巴兹·谢里夫、敏昂莱、武文赏、阮富仲、范明正、李光耀、哈莉玛·雅各布、李显龙等',
    '对华友好的国家领导人', '普京', '米哈伊尔·米舒斯京', '金正恩(及其家属)', '金德训', '阿里夫·阿尔维', '夏巴兹·谢里夫', '敏昂莱',
    '武文赏', '阮富仲', '范明正', '李光耀', '哈莉玛·雅各布', '李显龙',
    '政/军/公检法徽章(军徽、警徽)', '旗帜(军旗、警旗)', '军歌', '证书',
    '政/军/公检法徽章(军徽、警徽)、旗帜(军旗、警旗)、军歌、证书等专属或存在指代象征的物品',
    '国内重大会议，包括历届两会、中国共产党第XX次全国代表大会、中央政治局会、中央政治局常务委员会会议、中国共产党第xx届中央委员会第x次会议（如二十届二全会）、中央农村工作会议、中央经济工作会议、中央纪委全体会议',
    '国内重大会议', '两会', '中国共产党第XX次全国代表大会', '中央政治局会', '中央政治局常务委员会会议',
    '中国共产党第xx届中央委员会第x次会议（如二十届二全会）', '中央农村工作会议', '中央经济工作会议', '中央纪委全体会议',
    '党徽、党旗、国徽、国歌、红领巾、少年先锋队队委标志、队徽、中国共产主义青年团团旗、团徽等',
    '党徽', '党旗', '国徽', '国歌', '红领巾', '少年先锋队队委标志', '队徽', '中国共产主义青年团团旗', '团徽',
    '国内外涉及党政、国家相关旗帜的',
    '国内外党政旗帜', '外国国家旗帜',
    '天安门、中南海、人民大会堂、毛泽东纪念堂、新华门、南京大屠杀纪念馆、人民英雄纪念碑、抗美援朝纪念馆相关场景的，党政红色建筑、烈士陵园、红色旅游场景',
    '天安门', '中南海', '人民大会堂', '毛泽东纪念堂', '新华门', '南京大屠杀纪念馆', '人民英雄纪念碑', '抗美援朝纪念馆', '党政红色建筑', '烈士陵园', '红色旅游场景',
],
'不适合收录': [
    '民运事件六四（LS）历史画面、六四（LS）人物、讲述LS历史事件、LS相关纪念品/标志物、LS歌曲和纪念LS节目活动的图片或者文字材料',
    '国内外其他民运事件,包括光州事件、太阳花运动、中国茉莉花革命、全民共振革命、香港七一大游行、雨伞革命等',
    '分裂势力相关人物、旗帜、组织',
    '港澳台地区政治称谓错误',
    '台湾总统府、台湾总统、台湾外交部，和台湾相关的敏感内容',
    '中国地图、中国地貌',
    '中华民国的，包括国名党、蒋介石等国军人物、旗帜等',
    '国内国外认定的邪教组织相关的回邪教资料,或出现相关敏感人物、邪教媒体、旗帜标语（包括邪教名单:FLC、全能神/东方闪电、心灵法门、呼喊派、全范围教会、门徒会、灵灵教(又称"属灵教"、"灵灵派")、被立王、观音法门(又称"清海无上师世界里早会")、天父的儿女、达米宣教会、真佛宗、新约教会(亦称"基督灵恩布道团")、世界以利亚福音宣教会、统一教、主神教、三班仆人）等',
    '邪教媒体:澳洲东方华语电视台、无上师网络电视台(Suprenhe MasterTV)、真佛资讯网TBSNTV、东方闪电网站、新唐人、大纪元、阿波罗、希望之声SOH1、法轮大法明慧网、动态网、神韵晚会、法轮大法正见网、真相传媒(真相Truth)、美丽日报、禁闻网、玄艺综述、玄艺问答、艺术与责灵性网络电视台、与上帝直接连线、真佛资讯网TBSN-TV、真佛宗网路中文网、世界真佛报、马求西亚真佛宗客密宗总会、真佛宗网络大学、真佛般若藏、世界和平统一家庭联合会网站、Eastern Light、未后方舟。全能神教会/TheChurchof AlmightyGod、国度降临福音网、东方闪电网站、石山角度、时事金扫描、文昭谈古论今、文昭思绪飞扬',
    '政治意识形态、文化差异、历史特殊背景容易引起争议的内容',
],
'违法违规': [
    '杀人、赌博、诈骗、欺骗、殴打、暴力血腥、虐待、毒品、 极端引入不适的内容',
    '买卖假币、教授、教唆洗钱',
    '传销组织、传销场景、传销过程',
    '非法组织或招募人员（境外赌博机构、违法机构、邪教组织、非法宗教和有害气功组织等）',
    '平台上管控的书籍，例如（《中国共产党简史》《N1新时代中国特色社会主义思想学习问答》《论中国共产党历史》《毛泽东邓小平江泽民胡锦涛关于中国共产党历史论述摘编》@《N1谈治国理政》等涉党政书籍）',
    '宣传封建迷信行为或引诱、宣传、教授相关迷信内容',
    '毒品、违禁药品、凶杀现场、吸毒工具、吸毒讲解相关的图片或者文字',
    '六合彩、宣扬实质赌博、或者其他违法犯罪的事情',
],
'色情': [
    '性行为内容、裸露敏感部位、传播色情资源以及性器具。也指通过文字、视觉、语言描绘，或者是表现裸体、性器官、性交等一切与性有关的形象，使观赏之人产生性兴趣、性兴奋的事物',
    '卖淫、嫖娼、拉皮条等行为',
    '性行为，例如阴道性交、肛交、口交、女阴道摩擦、阴茎摩擦、舐阴、乳交、手交、足交',
    '敏感部位裸露指的是裸露人体性器官，包含男性睾丸、男性阴茎、女性外阴、女性乳头、女性主乳晕、阴毛、肛门、肛毛等',
    '带有赤裸、裸露、露出等关键词',
    '色情资源，即描述性行为过程、画面、声音、敏感部位外形、使使用方式等的文字、图片或视频资源,例如磕炮(文爱)、黄漫、黄片、色情网站、福利姬周边、色情直播/录屏、色情/小说、色情聊天记录等。包括提及性行为、高潮、敏感部位、色情资源名称的内容。',
    '性器具，即可以代替生殖器用于性行为的器具，包括假阴茎、双头龙、跳蛋、按摩棒、人工阴道、拉珠、锁精环、充气娃娃、飞机杯、锁精环等。',
    '色情相关的隐晦的变体词、同音词、谐音词、缩略词等进行色情描述，例如性行为的其他描述方式：打炮、啪啪啪、上床等，以及敏感部位的其他描述方式。例如男士生殖器的描述：鸡巴、肉棒、男人的小弟弟，第三条腿等，女性的生殖器描述：阴穴、肉穴、阴道等。',
],
'低俗': [
    '低俗，包含男女低俗着装，低俗的动作和行为，低俗场所，低俗物品',
    '低俗的动作和行为',
    '低俗物品',
    '低俗场所',
    '男女低俗着装涉及男女裸体（没有露出敏感部位）。着装暴露，一般是指女性胸部过度裸露、露外/正下乳、裸背、露三角区未露敏感部位、臀部大面积裸露等。女性胸部过度裸露详细是指胸部没有穿衣物，或者衣物过少导致大部分胸部展示在外，从而形成色情暗示，还有胸部过大，明显与身材不成比例。',
    '男女低俗着装涉及男女裸体（没有露出敏感部位）。',
    '着装暴露，女性胸部过度裸露、露外/正下乳、裸背、露三角区未露敏感部位、臀部大面积裸露等。',
    '女性胸部过度裸露详细是指胸部没有穿衣物，或者衣物过少导致大部分胸部展示在外，从而形成色情暗示',
    '还有胸部过大，明显与身材不成比例。',
    '低俗动作和行为指男女高潮脸，敏感部位轮廓明显，低俗动作，低俗行为，特殊性癖好等。高潮脸特征为翻白眼,或者接近翻白眼的状态。也有眼神涣散呆滞、内斜视(俗称「斗鸡眼」)、强奸眼(指那种瞳孔和虹膜涂成一种颜色的眼睛,大致和死鱼眼一样)、瞳孔里有粉色爱心等类型。以及嘴巴大开,舌头伸出来，流满口水、鼻涕、眼泪、汗等体液。敏感部位轮廓明显，表现形式:骆驼趾、男性下体凸出、女性胸部凸点等。低俗动作包含刻意做出低俗动作或引导露出内衣裤/三角连体衣:掀裙子、低角度、撅屁股、分开双腿等，以及内容为引导关注、抚摸、攻击女性胸部/男女臀部，例如:摸胸、摸臀，千年杀等。低俗行为涉及低俗表演行为，例如:抖胸、抖臀、顶胯、脱衣舞等，还包含涉及与道具低俗互动引起联想，例如:与黄瓜、香蕉互动暗示性行为、类似性器官等。特殊性癖好包含SM、窥阴癖、恋尸癖、恋童癖、恋孕癖、绿帽癖、恋老癖、恋足癖、丝袜诱惑、原味内衣、原味裤袜、慕残者、人与动物舌吻等。',
    '男女高潮脸', '敏感部位轮廓明显', '低俗动作', '低俗行为', '特殊性癖好', '女性骆驼趾', '男性下体凸出', '女性胸部凸点等', '露出内衣裤', '三角连体衣', '掀裙子、低角度、撅屁股、分开双腿', '抚摸、攻击女性胸部/男女臀部', '摸胸、摸臀，千年杀', '抖胸、抖臀、顶胯、脱衣舞', '与道具低俗互动引起联想，例如:与黄瓜、香蕉互动暗示性行为', '类似性器官', '特殊性癖好，包含SM、窥阴癖、恋尸癖、恋童癖、恋孕癖、绿帽癖、恋老癖、恋足癖、丝袜诱惑、原味内衣、原味裤袜、慕残者、人与动物舌吻等',
    '低俗场所主要涉及成人娱乐场所，且具有色情的意图，例如涉及国内外的色情交易场所，别名红灯区。',
    '红灯区',
    '低俗物品包含避孕套等有色情低俗意图的物品，低俗物品同时还有av演员名字，av作品名称等色情内容，av演员名称例如：波多野结衣、苍井空、河北彩花等。',
    '避孕套', 'av作品名称', 'av演员名称例如：波多野结衣、苍井空、河北彩花等',
],
'违反公序良俗': [
    '违反公序良俗指的是虽然没有涉及违法犯罪底线，但是从道德、语言、行为上存在冒犯或者侵犯他人的行为，造成他人精神受损或者生活受到不良影响。一般包含以下几个内容。',
    '涉及侮辱攻击他人的导向的脏话，例如贱人、贱货、死变态、猪脑子等等',
    '祖安文化，网络用语，指以网络粗口为核心的青年亚文化，是一种网络庸俗文化，主要为攻击辱骂场景。例如“祖安大舞台，有妈你就来”、“管好你自己，不然就藏好你的妈”、“去拼多多三块八拼个妈再和我说话”。核心是骂人的话术中都会携带“妈”字。',
    '外国人非正常、非正式称呼，例如黑鬼（代指黑人）、尼哥（代指黑人）、东南亚猴子（东南亚人）、老毛子（俄罗斯人）等。',
    '涉及小众婚恋观，主要涉及LGBT等相关名词和变种词语。例如男同性恋、女同性恋等专有名词。以及两个男人亲吻等动作等。',
    '不正当男女关系,换妻/偷情/捉奸/一夜情/干爹包养/包二奶/出轨找小三/拆散情侣/多个伴侣(如一男多女、一女多男/不伦关系(如姐夫和小姨子、直系亲属间背伦)等、不区分是否演绎。',
    '极端男女权相关污名化词汇及手势，例如:婚驴、姆苟、蜕喃的、蝈蝻、小屌子们、屌癌、蝈男等',
],
'未成年色情': [
    '未成年敏感部位裸露、涉性行为/性器具内容',
    '未成年索取/分享传播色情资源:工口小说(里番、肉番、黄番、h漫、h番、h文、肉肉文)等',
    '将未成年人的身材与性感、早熟(指身材)、丰满关联在一起的内容。',
    '未成年穿黑丝、渔网袜，或穿白丝露出腿部肌肤。',
    '未成年涉及低俗动作/行为、低俗着装等或有其他低俗引导内容。',
    '出现福利姬相关词汇，涉及未成年，福利群不明确内容时，等同福利姬处理，关联未成年。',
    '将未成年关联避孕套、避孕药等计生用品、情趣用品等。',
    '同时还有将未成年人和宗教活动进行绑定，以及未成年人穿戴不合适服饰，例如未成年穿戴里切克服饰。',
],
}

idx2action = {
'国内领导人': [
    '辱骂、负面隐晦、嘲讽、国内领导人或者使用变体词、同音词、谐音词等不怀好意指代他们， 疑似和国内领导人相关的任何内容',
    '辱骂', '负面隐晦', '嘲讽', '使用变体词、同音词、谐音词等不怀好意指代他们',
    '模仿（例如模仿领导人在办公室、在阅兵、在开会、在讲话等）',
    '包含有', '涉及到', '展示',
],
'时政': [
    '过度娱乐化、恶搞、攻击等负面内容',
    '过度娱乐化', '恶搞', '攻击', '负面内容',
    '包含有', '涉及到', '展示',
],
'不适合收录': [
    '',
    '包含有', '涉及到', '展示',
],
'违法违规': [
    '',
    '包含有', '涉及到', '展示', '宣传', '教唆'
],
'色情': [
    '',
    '包含有', '涉及到', '展示', '宣传', '交易'
],
'低俗': [
    '',
    '包含有', '涉及到', '展示'
],
'违反公序良俗': [
    '',
    '包含有', '涉及到', '展示'
],
'未成年色情': [
    '',
    '包含有', '涉及到', '展示'
],
}

idx2restrain = {
'国内领导人': [
    '',
    '',
    '',
    '',
    '用影射、指代、变形字、同音字、同义词替换的方法，对原句敏感词进行替换，以混淆审核人员逃避平台审核',
    '是描述图片内容的短句或者关键词的组合',
],
'时政': [
    '',
    '',
    '',
    '隐晦类型指的是用影射、变体词替换的方法，对原句内容进行替换',
    '是描述图片内容的短句或者关键词的组合',
],
'不适合收录': [
    '',
    '',
    '',
    '隐晦类型指的是用影射、变体词替换的方法，对原句内容进行替换，以混淆审核人员，希望能够逃避平台审核',
    '是描述图片内容的短句或者关键词的组合',
],
'违法违规': [
    '',
    '',
    '',
    '隐晦类型指的是用影射、变体词替换的方法，对原句内容进行替换，以混淆审核人员，希望能够逃避平台审核',
    '是描述图片内容的短句或者关键词的组合',
],
'色情': [
    '',
    '',
    '',
    '是描述图片内容的短句或者关键词的组合',
],
'低俗': [
    '',
    '',
    '',
    '是描述图片内容的短句或者关键词的组合',
],
'违反公序良俗': [
    '',
    '',
    '',
    '是描述图片内容的短句或者关键词的组合',
],
'未成年色情': [
    '',
    '',
    '',
    '生成的话语中需要明确指明未成年人或者小孩',
    '是描述图片内容的短句或者关键词的组合',
],
'r1': [
    '每条包含10~100个字',
    '每条不超过60字',
    '每条大于20字',
    '每条字数大于30字',
    '每条的内容多于50个字',
    '每条的内容多于50个字',
    '每条的内容多于70个字',
    '每条的内容多于100个字',
],
}


if __name__ == '__main__':
    from aitool import get_pair, dump_excel
    all_data = {
        'prompt': prompt,
        'idx2theme': idx2theme,
        'idx2action': idx2action,
        'idx2restrain': idx2restrain,
    }
    show = list(get_pair(all_data))
    dump_excel(show, 'show_prompts_fine.xlsx')
