// 当前模块使用 ES Modules 语法, PyExecJS2 不可使用该模块
// 该目录必须有 package.json 的 {"type": "module"}
// 当前系列模块为 ES Modules 语法 的 helper.js 提供了 读写文件操作, 当需要使用 node命令运行时所需
// ----------------------------------------------------------------------------------------------------
import fs from 'fs'
// ----------------------------------------------------------------------------------------------------
const encoding = 'utf8'
// ----------------------------------------------------------------------------------------------------
// 同步读文件
const read = src => fs.readFileSync(src, encoding)
// 同步写文件
const save = (src, data) => fs.writeFileSync(src, data, encoding)
// ----------------------------------------------------------------------------------------------------
const main_02 = () => {
    const u00 = decodeURIComponent(import.meta.url.slice('file:///'.length))
    const u01 = process.argv[1].replaceAll('\\', '/')
}
// ----------------------------------------------------------------------------------------------------
export {read, save}