from m3.db import BaseEnumerate


class PendingUpdateOrderRequestSourceVersionEnum(BaseEnumerate):
    """Версия (Тип) источника для отложенного запроса OrderRequest."""

    V_0 = 0
    V_1 = 1
    V_2 = 2
    V_3 = 3
    V_4 = 4
    V_5 = 5
    V_6 = 6

    values = {
        V_0: 'Отказ в изменении заявления',
        V_1: 'Создание изменений заявления',
        V_2: 'Изменение статуса заявления',
        V_3: 'Изменение данных заявления (кроме статуса)',
        V_4: 'Изменение желаемых ДОО заявления',
        V_5: 'Изменение статуса направления заявления',
        V_6: 'Изменение данных ребенка',
    }
